20260115192203-linux_tips.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-03-29 Sun 12:54 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>linux tips</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">linux tips</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org4c432ee">Essential Commands</a>
<ul>
<li><a href="#org94947e5">File Operations</a></li>
<li><a href="#orga6a92e8">System Information</a></li>
</ul>
</li>
<li><a href="#orgd8dfc87">Package Management</a></li>
<li><a href="#org0bcf611">Useful Bash Aliases</a></li>
<li><a href="#orgab10a7c">Working with Git</a></li>
<li><a href="#orgca7dd55">Related Notes</a></li>
<li><a href="#org5c18512">References</a></li>
</ul>
</div>
</div>

<div id="outline-container-org4c432ee" class="outline-2">
<h2 id="org4c432ee">Essential Commands</h2>
<div class="outline-text-2" id="text-org4c432ee">
</div>
<div id="outline-container-org94947e5" class="outline-3">
<h3 id="org94947e5">File Operations</h3>
<div class="outline-text-3" id="text-org94947e5">
<ul class="org-ul">
<li><code>ls -lah</code> - List all files with human-readable sizes</li>
<li><code>cp -r source/ dest/</code> - Copy directories recursively</li>
<li><code>find . -name "*.org"</code> - Find all org files in current directory</li>
</ul>
</div>
</div>

<div id="outline-container-orga6a92e8" class="outline-3">
<h3 id="orga6a92e8">System Information</h3>
<div class="outline-text-3" id="text-orga6a92e8">
<ul class="org-ul">
<li><code>df -h</code> - Check disk space</li>
<li><code>free -h</code> - Check memory usage</li>
<li><code>top</code> or <code>htop</code> - Monitor processes</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgd8dfc87" class="outline-2">
<h2 id="orgd8dfc87">Package Management</h2>
<div class="outline-text-2" id="text-orgd8dfc87">
<p>
For Debian/Ubuntu based systems:
</p>
<div class="org-src-container">
<pre class="src src-bash">sudo apt update
sudo apt upgrade
sudo apt install package-name
</pre>
</div>
</div>
</div>

<div id="outline-container-org0bcf611" class="outline-2">
<h2 id="org0bcf611">Useful Bash Aliases</h2>
<div class="outline-text-2" id="text-org0bcf611">
<p>
Add these to your <code>.bashrc</code>:
</p>
<div class="org-src-container">
<pre class="src src-bash">alias ll='ls -lah'
alias ..='cd ..'
alias gs='git status'
alias gc='git commit'
</pre>
</div>
</div>
</div>

<div id="outline-container-orgab10a7c" class="outline-2">
<h2 id="orgab10a7c">Working with Git</h2>
<div class="outline-text-2" id="text-orgab10a7c">
<p>
Basic workflow:
</p>
<ol class="org-ol">
<li><code>git status</code> - Check current changes</li>
<li><code>git add .</code> - Stage all changes</li>
<li><code>git commit -m "message"</code> - Commit with message</li>
<li><code>git push</code> - Push to remote</li>
</ol>
</div>
</div>

<div id="outline-container-orgca7dd55" class="outline-2">
<h2 id="orgca7dd55">Related Notes</h2>
<div class="outline-text-2" id="text-orgca7dd55">
<ul class="org-ul">
<li>Back to <a href="20260115192033-first_knowledge_base.html#ID-2a30ee8a-355c-408c-bce6-8c575e23d72a">first knowledge base</a></li>
</ul>
</div>
</div>

<div id="outline-container-org5c18512" class="outline-2">
<h2 id="org5c18512">References</h2>
</div>
</div>
</body>
</html>